/*
   Данный код успешно компилируется и на консоли
   появится сообщение:
        You are the best!

   Все зависит от версии компилятора и опций компиляции.
   Интереснее всего смотреть, что получится при 
   использовании gcc9 без опций.

   Дело в том, что в С нет или не было прям жесткого 
   требования на тип символа main. Он в целом может 
   быть и массивом:
        char main[10];
   хоть указателем на функцию:
        void (main)();
 
   Воистину, C/C++ - это самые интересные языки из
   существующих языков программирования.
 */

const int main[] = {
        -98693133, -443987883, 440, 113408,
        -1922629632, 4149, 1227264, 84869120,
        15544, 266023168, 1970231557,
        1701994784, 1701344288, 1936024096,
        -1878384268, 258392925
};

